src/DataProcessors/ОтложенноеПроведениеДокументовИзТоплог.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОтложенноеПроведениеДокументовИзТоплог</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ОтложенноеПроведениеДокументовИзТопЛог.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОтложенноеПроведениеДокументовИзТопЛог</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаНаДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОшибкиПриОбменеСТопЛог.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОшибкиПриОбменеСТопЛог</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СообщениеОбОшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗагрузкиСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектXDTO</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUIDДоп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОбъектаМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьРубли</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВозврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРеглВозврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпрВозврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<Comment>(Общ)</Comment>
			<BasedOn>
				<xr:Item>Document.ВнутреннийЗаказ</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваровVMI</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровВПути</xr:Item>
				<xr:Item>AccumulationRegister.ЗаявкиПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ОтказыПоЗаявкам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКРезервированию</xr:Item>
				<xr:Item>AccumulationRegister.ПополнениеСклада</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВПути</xr:Item>
				<xr:Item>AccumulationRegister.РезервыТоваров</xr:Item>
				<xr:Item>InformationRegister.ИсторияЗаявокПокупателя</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПеремещенияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФилиалОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФилиалПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>если реквизит заполнен - значит идет приемка из ТопЛог</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеСсылкаТопЛог</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгруженВТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновленИзТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданВ77</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флНеВыгружатьВТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктРассмотренияВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктРассмотренияВозврата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поступление</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНеПринято</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Качество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Качество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПрихода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаЗаявки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/ОтложенноеПроведениеДокументовИзТоплог/Ext/ObjectModule.bsl
Процедура ВыполнитьРегламентноеЗадание() Экспорт
		
	лКлючАлгоритма = "Обработка_ОтложенноеПроведениеДокументовИзТоплог_ВыполнитьРегламентноеЗадание";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;

	АктуализацияОшибокТопЛог();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОтложенноеПроведениеДокументовИзТопЛог.СсылкаНаДокумент,
	|	ВЫБОР
	|		КОГДА ОтложенноеПроведениеДокументовИзТопЛог.СсылкаНаДокумент ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА 0
	|		КОГДА ОтложенноеПроведениеДокументовИзТопЛог.СсылкаНаДокумент ССЫЛКА Документ.ПеремещениеТоваров
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Порядок,
	|	ОтложенноеПроведениеДокументовИзТопЛог.СтатусДокумента
	|ИЗ
	|	РегистрСведений.ОтложенноеПроведениеДокументовИзТопЛог КАК ОтложенноеПроведениеДокументовИзТопЛог
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	ОтложенноеПроведениеДокументовИзТопЛог.СсылкаНаДокумент.Дата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если ТипЗнч(Выборка.СсылкаНаДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
			Попытка
				Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.СсылкаНаДокумент, "Проведен,СтатусДокумента,ПометкаУдаления");
				Если Реквизиты.ПометкаУдаления = Истина Или (Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.РеализацияТоваровУслугОтгружен И Реквизиты.Проведен = Истина И (Не ЗначениеЗаполнено(Выборка.СтатусДокумента) Или Выборка.СтатусДокумента = Справочники.СтатусыДокументов.РеализацияТоваровУслугОтгружен))  
					Или ((Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.РеализацияТоваровУслугГотовКВыдаче Или Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.РеализацияТоваровУслугОтгружен) И Реквизиты.Проведен = Истина И Выборка.СтатусДокумента = Справочники.СтатусыДокументов.РеализацияТоваровУслугГотовКВыдаче)
					Или  ((Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.РеализацияТоваровУслугУпакован Или Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.РеализацияТоваровУслугГотовКВыдаче Или Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.РеализацияТоваровУслугОтгружен) И Реквизиты.Проведен = Истина И Выборка.СтатусДокумента = Справочники.СтатусыДокументов.РеализацияТоваровУслугУпакован) Тогда 
					лНаборЗаписей = РегистрыСведений.ОтложенноеПроведениеДокументовИзТопЛог.СоздатьНаборЗаписей();
					лНаборЗаписей.Отбор.СсылкаНаДокумент.Установить(Выборка.СсылкаНаДокумент);
					лНаборЗаписей.Записать(Истина);				
				Иначе
					ДокОбъект = Выборка.СсылкаНаДокумент.ПолучитьОбъект();
					Если Не ЗначениеЗаполнено(Выборка.СтатусДокумента) Или  Выборка.СтатусДокумента = Справочники.СтатусыДокументов.РеализацияТоваровУслугОтгружен  Тогда 
						ДокОбъект.СтатусДокумента = Справочники.СтатусыДокументов.РеализацияТоваровУслугОтгружен;
					Иначе
						ДокОбъект.СтатусДокумента = Выборка.СтатусДокумента;
					КонецЕсли;
					//Если ДокОбъект.СтатусДокумента <> Справочники.СтатусыДокументов.РеализацияТоваровУслугОтгружен Тогда 
					//	ДокОбъект.Дата = ТекущаяДата();
					//КонецЕсли;
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
			КонецПопытки;
		ИначеЕсли ТипЗнч(Выборка.СсылкаНаДокумент) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда 
			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.СсылкаНаДокумент, "ПометкаУдаления,Проведен,СтатусДокумента,ДокументОснование, ДокументОснование.СтатусДокумента, ДокументОснование.ОбновленИзТопЛог, ДокументОснование.Дата, ДокументОснование.Склад.СкладПриемки");
			
			УсловиеПоступление = ТипЗнч(Реквизиты.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") И (Реквизиты.ДокументОснованиеСтатусДокумента = Справочники.СтатусыДокументов.ПоступлениеТоваровПринят Или
			Реквизиты.ДокументОснованиеСтатусДокумента = Справочники.СтатусыДокументов.ПоступлениеТоваровРазмещен);
			УсловиеПеремещение =  ТипЗнч(Реквизиты.ДокументОснование) = Тип("ДокументСсылка.ПеремещениеТоваров") И (Реквизиты.ДокументОснование.ОбновленИзТопЛог = Истина Или СтрНачинаетсяС(Реквизиты.ДокументОснование.Номер, "D")
			Или ПроведениеДокументовКлиентСервер.ИсходящееПеремещениеРазрешеноРазмещениеБезСборки(Реквизиты.ДокументОснование));
			
			Если Реквизиты.ПометкаУдаления = Истина Или (Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил И Реквизиты.Проведен = Истина) Тогда 
				лНаборЗаписей = РегистрыСведений.ОтложенноеПроведениеДокументовИзТопЛог.СоздатьНаборЗаписей();
				лНаборЗаписей.Отбор.СсылкаНаДокумент.Установить(Выборка.СсылкаНаДокумент);
				лНаборЗаписей.Записать(Истина);				
			ИначеЕсли  УсловиеПоступление Или УсловиеПеремещение Тогда 
				НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
				Попытка
					ДокОбъект = Выборка.СсылкаНаДокумент.ПолучитьОбъект();
					//Если ДокОбъект.Дата < Реквизиты.ДокументОснованиеДата Тогда 
					//	ДокОбъект.Дата = Реквизиты.ДокументОснованиеДата + 1;
					//КонецЕсли;	
					ДокОбъект.Дата = ТекущаяДата();
					
					Если УсловиеПоступление И ДокОбъект.СкладОтправитель <> Реквизиты.ДокументОснованиеСкладСкладПриемки Тогда 
						ДокОбъект.СкладОтправитель = Реквизиты.ДокументОснованиеСкладСкладПриемки;	
					КонецЕсли;
					
					Если УсловиеПеремещение И Не ДокОбъект.Проведен Тогда 
						ДокОбъект.Записать(); //Чтобы изменилась дата в ссылке
						Документы.ПеремещениеТоваров.ЗаполнитьОрганизацииТЧТоварыПоПартиям(ДокОбъект);
					КонецЕсли;
					
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
					лНаборЗаписей = РегистрыСведений.ОтложенноеПроведениеДокументовИзТопЛог.СоздатьНаборЗаписей();
					лНаборЗаписей.Отбор.СсылкаНаДокумент.Установить(Выборка.СсылкаНаДокумент);
					лНаборЗаписей.Записать(Истина);				
					
					ЗафиксироватьТранзакцию();
				Исключение
					ОтменитьТранзакцию();
				КонецПопытки;
			КонецЕсли;
		ИначеЕсли  ТипЗнч(Выборка.СсылкаНаДокумент) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда 
			НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
			Попытка
				ДокОбъект = Выборка.СсылкаНаДокумент.ПолучитьОбъект();
				ДокОбъект.СтатусДокумента = Справочники.СтатусыДокументов.ПоступлениеТоваровПринят;
				
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
				лНаборЗаписей = РегистрыСведений.ОтложенноеПроведениеДокументовИзТопЛог.СоздатьНаборЗаписей();
				лНаборЗаписей.Отбор.СсылкаНаДокумент.Установить(Выборка.СсылкаНаДокумент);
				лНаборЗаписей.Записать(Истина);				
				
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
			КонецПопытки;
		ИначеЕсли  ТипЗнч(Выборка.СсылкаНаДокумент) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда 
			
			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.СсылкаНаДокумент, "СтатусДокумента");
			
			Если Реквизиты.СтатусДокумента =  Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяНовый Тогда
				
				НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
				Попытка
					ДокОбъект = Выборка.СсылкаНаДокумент.ПолучитьОбъект();
					//ДокОбъект.СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяПринят;
					
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
					лНаборЗаписей = РегистрыСведений.ОтложенноеПроведениеДокументовИзТопЛог.СоздатьНаборЗаписей();
					лНаборЗаписей.Отбор.СсылкаНаДокумент.Установить(Выборка.СсылкаНаДокумент);
					лНаборЗаписей.Записать(Истина);				
					
					ЗафиксироватьТранзакцию();
				Исключение
					ОтменитьТранзакцию();
				КонецПопытки;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура АктуализацияОшибокТопЛог()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОшибкиПриОбменеСТопЛог.ОбъектXDTO,
	|	ОшибкиПриОбменеСТопЛог.GUID,
	|	ОшибкиПриОбменеСТопЛог.GUIDДоп,
	|	ОшибкиПриОбменеСТопЛог.ИмяОбъектаМетаданных,
	|	ОшибкиПриОбменеСТопЛог.СообщениеОбОшибке,
	|	ОшибкиПриОбменеСТопЛог.НомерСообщения,
	|	ОшибкиПриОбменеСТопЛог.ДатаЗагрузкиСообщения
	|ИЗ
	|	РегистрСведений.ОшибкиПриОбменеСТопЛог КАК ОшибкиПриОбменеСТопЛог
	|ГДЕ
	|	ОшибкиПриОбменеСТопЛог.GUID <> """"";
	Выборка = Запрос.Выполнить().Выбрать();
	Очищено = 0;
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ИмяОбъектаМетаданных = "ПоступлениеТоваровУслуг" Тогда 
			Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ." +  Выборка.ИмяОбъектаМетаданных);
			
			ДокСсылка = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(Выборка.GUID));
			
			Если ДокСсылка.Проведен И (ДокСсылка.СтатусДокумента = Справочники.СтатусыДокументов.ПоступлениеТоваровПринят
				или  ДокСсылка.СтатусДокумента = Справочники.СтатусыДокументов.ПоступлениеТоваровРазмещен) Тогда 
				НаборЗаписей = РегистрыСведений.ОшибкиПриОбменеСТопЛог.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ОбъектXDTO.Установить(Выборка.ОбъектXDTO);
				НаборЗаписей.Отбор.GUID.Установить(Выборка.GUID);
				НаборЗаписей.Отбор.GUIDДоп.Установить(Выборка.GUIDДоп);
				НаборЗаписей.Отбор.ИмяОбъектаМетаданных.Установить(Выборка.ИмяОбъектаМетаданных);
				НаборЗаписей.Записать();
				Очищено = Очищено + 1;
			КонецЕсли;
		ИначеЕсли Выборка.ИмяОбъектаМетаданных = "ПеремещениеТоваров" Тогда
			Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ." +  Выборка.ИмяОбъектаМетаданных);
			Если Выборка.ОбъектXDTO = "РезультатРазмещения" Тогда 
				Если ПустаяСтрока(Выборка.GUIDдоп) Тогда 
					Продолжить;
				КонецЕсли;
				ДокСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(Выборка.GUIDдоп));
				
				Если ОбменДаннымиКлиентСервер.ЭтоБитаяСсылка(ДокСсылка) Тогда 
					ДокСсылка = Документы.ПеремещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(Выборка.GUIDдоп));
				КонецЕсли;
				
				Если ОбменДаннымиКлиентСервер.ЭтоБитаяСсылка(ДокСсылка) Тогда
					Продолжить;
				КонецЕсли;
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ПеремещениеТоваров.Ссылка
				|ИЗ
				|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
				|ГДЕ
				|	ПеремещениеТоваров.ДокументОснование = &ДокументОснование
				|	И ПеремещениеТоваров.РазмещениеСсылкаТопЛог = &РазмещениеСсылкаТопЛог
				|	И НЕ ПеремещениеТоваров.Проведен
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПеремещениеТоваров.Ссылка
				|ИЗ
				|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
				|ГДЕ
				|	ПеремещениеТоваров.ДокументОснование = &ДокументОснование
				|	И ПеремещениеТоваров.РазмещениеСсылкаТопЛог = &РазмещениеСсылкаТопЛог
				|	И ПеремещениеТоваров.Проведен";
				Запрос.УстановитьПараметр("ДокументОснование", ДокСсылка);
				Запрос.УстановитьПараметр("РазмещениеСсылкаТопЛог", Новый УникальныйИдентификатор(Выборка.GUID));
				Результаты = Запрос.ВыполнитьПакет();
				Если Результаты[0].Пустой() И Не Результаты[1].Пустой() Тогда 
					НаборЗаписей = РегистрыСведений.ОшибкиПриОбменеСТопЛог.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.ОбъектXDTO.Установить(Выборка.ОбъектXDTO);
					НаборЗаписей.Отбор.GUID.Установить(Выборка.GUID);
					НаборЗаписей.Отбор.GUIDДоп.Установить(Выборка.GUIDДоп);
					НаборЗаписей.Отбор.ИмяОбъектаМетаданных.Установить(Выборка.ИмяОбъектаМетаданных);
					НаборЗаписей.Записать();
					Очищено = Очищено + 1;
				КонецЕсли;
			ИначеЕсли Выборка.ОбъектXDTO = "РезультатСборки" Тогда 
				ДокСсылка = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(Выборка.GUID));
				Если ДокСсылка.Проведен И ДокСсылка.ОбновленИзТоплог Тогда 
					НаборЗаписей = РегистрыСведений.ОшибкиПриОбменеСТопЛог.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.ОбъектXDTO.Установить(Выборка.ОбъектXDTO);
					НаборЗаписей.Отбор.GUID.Установить(Выборка.GUID);
					НаборЗаписей.Отбор.GUIDДоп.Установить(Выборка.GUIDДоп);
					НаборЗаписей.Отбор.ИмяОбъектаМетаданных.Установить(Выборка.ИмяОбъектаМетаданных);
					НаборЗаписей.Записать();
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли  Выборка.ИмяОбъектаМетаданных = "РеализацияТоваровУслуг" Тогда
			Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ." +  Выборка.ИмяОбъектаМетаданных);
			ДокСсылка = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(Выборка.GUID));
			Если ДокСсылка.Проведен И ДокСсылка.СтатусДокумента = Справочники.СтатусыДокументов.РеализацияТоваровУслугОтгружен Тогда  
				Если Не ДокСсылка.ПолныйОтказ Тогда 
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
					|	Продажи.Регистратор
					|ИЗ
					|	РегистрНакопления.Продажи КАК Продажи
					|ГДЕ
					|	Продажи.Регистратор = &Регистратор";
					Запрос.УстановитьПараметр("Регистратор", ДокСсылка);
					Если Не Запрос.Выполнить().Пустой() Тогда 
						НаборЗаписей = РегистрыСведений.ОшибкиПриОбменеСТопЛог.СоздатьНаборЗаписей();
						НаборЗаписей.Отбор.ОбъектXDTO.Установить(Выборка.ОбъектXDTO);
						НаборЗаписей.Отбор.GUID.Установить(Выборка.GUID);
						НаборЗаписей.Отбор.GUIDДоп.Установить(Выборка.GUIDДоп);
						НаборЗаписей.Отбор.ИмяОбъектаМетаданных.Установить(Выборка.ИмяОбъектаМетаданных);
						НаборЗаписей.Записать();
						Очищено = Очищено + 1;
					КонецЕсли;
				Иначе
					НаборЗаписей = РегистрыСведений.ОшибкиПриОбменеСТопЛог.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.ОбъектXDTO.Установить(Выборка.ОбъектXDTO);
					НаборЗаписей.Отбор.GUID.Установить(Выборка.GUID);
					НаборЗаписей.Отбор.GUIDДоп.Установить(Выборка.GUIDДоп);
					НаборЗаписей.Отбор.ИмяОбъектаМетаданных.Установить(Выборка.ИмяОбъектаМетаданных);
					НаборЗаписей.Записать();
					Очищено = Очищено + 1;
				КонецЕсли;
			ИначеЕсли ДокСсылка.ПометкаУдаления Тогда 
				НаборЗаписей = РегистрыСведений.ОшибкиПриОбменеСТопЛог.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ОбъектXDTO.Установить(Выборка.ОбъектXDTO);
				НаборЗаписей.Отбор.GUID.Установить(Выборка.GUID);
				НаборЗаписей.Отбор.GUIDДоп.Установить(Выборка.GUIDДоп);
				НаборЗаписей.Отбор.ИмяОбъектаМетаданных.Установить(Выборка.ИмяОбъектаМетаданных);
				НаборЗаписей.Записать();
				Очищено = Очищено + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Сообщить("Очищено: " + Очищено);
КонецПроцедуры
